export const state = () => ({
  intro: {
    title: 'عنوان',
    paragraph: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام استفاده قرار گیرد.',
    image: require('@/static/images/temp1.png')
  },
  topFeatures: {
    title: 'ویژگی ها',
    paragraph: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام استفاده قرار گیرد.',
    cards: [
      {
        title: 'تایتل',
        text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهو احان گرافیک است. چاپگرها ستون'
      },
      {
        title: 'تایتل',
        text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهو احان گرافیک است. چاپگرها ستون'
      },
      {
        title: 'تایتل',
        text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهو احان گرافیک است. چاپگرها ستون'
      },
      {
        title: 'تایتل',
        text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهو احان گرافیک است. چاپگرها ستون'
      }
    ]
  },
  Features: [
    {
      id: 'moshtari',
      title: 'مشتری',
      paragraph: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام استفاده قرار گیرد.',
      image: require('@/static/images/costomer.png'),
      reverse: false
    },
    {
      id: 'froshande',
      title: 'فروشنده',
      paragraph: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام استفاده قرار گیرد.',
      image: require('@/static/images/moshi.png'),
      reverse: true
    }
  ],
  screenShots: [
    {
      image: require('@/static/images/temp4.png'),
      strength: 5,
      type: 'depth',
      transformorigin: 'center',
      axis: ''
    },
    {
      image: require('@/static/images/temp2.png'),
      strength: 5,
      type: 'depth',
      transformorigin: 'center',
      axis: ''
    },
    {
      image: require('@/static/images/temp3.png'),
      strength: 5,
      type: 'depth',
      transformorigin: 'center',
      axis: ''
    },
    {
      image: require('@/static/images/temp2.png'),
      strength: 5,
      type: 'depth',
      transformorigin: 'center',
      axis: ''
    }
  ],
  moreFeatures: [
    {
      text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو  امید داشت که شامل حروفچینی گیرد.'
    },
    {
      text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرورد.'
    },
    {
      text: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در که شامل حروفچینی گیرد.'
    }
  ],
  contactUs: {
    title: 'تماس با ما',
    paragraph: 'لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشته، حال و آینده شناخت فراوان جامعه و متخصصان را می طلبد تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی و فرهنگ پیشرو در زبان فارسی ایجاد کرد. در این صورت می توان امید داشت که تمام استفاده قرار گیرد.',
    svgs: [
      require('@/static/images/time.svg'),
      require('@/static/images/man.svg'),
      require('@/static/images/telephone.svg')

    ],

    ways: [
      'شماره تماس : 09142365479',
      'ایمیل : email@domain.com'
    ]
  }
})

export const getters = {
  intro (state) {
    return state.intro
  },
  topFeatures (state) {
    return state.topFeatures
  },
  Features (state) {
    return state.Features
  },
  screenShots (state) {
    return state.screenShots
  },
  moreFeatures (state) {
    return state.moreFeatures
  },
  contactUs (state) {
    return state.contactUs
  }
}
